In [5]:
import pandas as pd

s1 = pd.Series({
    "김" : 100,
    "나" : 120,
    "박" : 150,
    "이" : 123
})

s1.name = "수학"

print(s1)

s2 = pd.Series({
    "김" : 10,
    "나" : 120,
    "박" : 150,
    "이" : 123
})
print(s2)

s3 = pd.Series([8, 3, 13, 2])
s3.name = "국어"

print(s3)

s4 = pd.Series([8, 3, 13, 2, 10])
print(s4)

김    100
나    120
박    150
이    123
Name: 수학, dtype: int64
김     10
나    120
박    150
이    123
dtype: int64
0     8
1     3
2    13
3     2
Name: 국어, dtype: int64
0     8
1     3
2    13
3     2
4    10
dtype: int64

In [8]:
df = pd.DataFrame({
    "출생지" : ['한국', "미국"],
    "나이" : [20, 30]
})

df

  출생지  나이
0  한국  20
1  미국  30

In [10]:
df['성별'] = ['여', '남']
df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남

In [11]:
df.loc[2] = ['일본', 25, '여']
df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남
2  일본  25  여

In [12]:
df2 = pd.DataFrame(s1)
df2['영어'] = s2
df2['미술'] = [1, 2, 3, 4]
df2

    수학   영어  미술
김  100   10   1
나  120  120   2
박  150  150   3
이  123  123   4

In [13]:
df2[['수학', '미술']] # 원하는 열 추출하기

    수학  미술
김  100   1
나  120   2
박  150   3
이  123   4

In [14]:
df2.loc[['김', '박']] # 원하는 행 추출하기

    수학   영어  미술
김  100   10   1
박  150  150   3

In [16]:
df2.loc['김','미술'] # df2.loc[행,열] ->  원하는 행 열 추출

1

In [18]:
df2.sum() # 각 열의 합

수학    493
영어    403
미술     10
dtype: int64

In [20]:
df2.mean() # 각 열의 평균 .mean(axis=1) => 행을 기준으로

수학    123.25
영어    100.75
미술      2.50
dtype: float64

In [22]:
print(df2.sum())
print(df2.mean(axis = 1))
df2['수학'].mean()

수학    493
영어    403
미술     10
dtype: int64
김     37.000000
나     80.666667
박    101.000000
이     83.333333
dtype: float64

123.25

## 미션 1

In [25]:
print(df2.loc[df2['영어'] >= 100, '수학'].mean())

131.0

In [26]:
# df2.loc[df2['영어'] >= 100, '수학'].mean()
# df2.loc[조건, 열의이름]
df2.loc[df2['영어'] >= 100, '수학']

나    120
박    150
이    123
Name: 수학, dtype: int64